tutorials/cfdemSolverRhoPimpleChem/3layerUnreactedCore/CFD/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0 0);

boundaryField
{
    // Walls in no slip condition
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    side-walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0.0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
