tutorials/cfdemSolverRhoPimpleChem/3layerUnreactedCore/CFD/constant/foam.inp
species
(
        CO
        CO2
	O2
	N2
);

reactions
{

}

