tutorials/cfdemSolverRhoPimpleChem/3layerUnreactedCore/CFD/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;

    div(phi,U)         Gauss linear; //Gauss upwind;
    div(phid,p)        Gauss linear; //Gauss upwind;
    div(phi,K)         Gauss linear;
    div(phi,h)         Gauss upwind;
    div(phi,k)         Gauss upwind;
    div(phi,epsilon)   Gauss upwind;
    div(U)             Gauss linear;
    div(phi,Yi_h)      Gauss upwind;
    // div((muEff*dev2(T(grad(U)))))           Gauss linear;
    div((viscousTerm*dev2(grad(U).T())))    Gauss linear;
    div((thermo:mu*dev(grad(U).T())))       Gauss linear;
    div((nuEff*dev2(T(grad(U)))))           Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p               ;
}


// ************************************************************************* //
